# 1
A = c(7.8, 5.1, 8.0, 6.5, 7.4, 8.2, 6.1)
B = c(9.2, 8.4 ,9.5 ,7.3 ,9.5 ,8.9 ,7.1)
quest1 = data.frame(A,B)
t.test(A,B)
# p-valor = 0.0204, logo as médias são diferentes. letra b

# 2
library(BSDA)
C1 = c(510,525,530,535,565,565,560,540,570,545,575,565,555,550,535,520,560,560,545,550)
z.test(
  C1,
  mu = 560,
  sigma.x = 15,
  conf.level = 0.95
)
# letra a


# 3 letra a

# 4
antes = c(85.5,84.7,84.9,86.3,83.8,84.2,82.9,83.5,84.8,85.3)
depois = c(96.7, 90.2, 90.5, 83.3, 77.6, 86.9, 68.5, 66.1, 87.7, 55.6)
t.test(antes,depois)
#letra b

#5
tempo = c(14,13,17,15,12,18,15,13,14,19,17,14,16,17,15)
t.test(tempo, mu = 15)
#

#6
atual = c(199.1,200.6,201.4,200.5,200.2,198.7,199.7,199.1,200.5,198.8)
proposto = c(203.3,205.5,205.3,205.4,203.8,205.8,205.2,205.5,204.4,206.3)
var.test(atual, proposto, alternative = "two.sided")
#letra a

#7
amostra = c(0,1,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,0)